# Handale catagorical Feature

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("titanic.csv",usecols=["Sex"])

In [3]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

# one hot encodeing

In [4]:
df1=pd.get_dummies(df,drop_first=True).head()

In [5]:
df1

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [6]:
df1=df1.rename(columns={"Sex_male":"Sex"})

In [7]:
df1

   Sex
0    1
1    0
2    0
3    0
4    1

In [8]:
df=pd.read_csv("titanic.csv",usecols=["Embarked"])

In [9]:
df

    Embarked
0          S
1          C
2          S
3          S
4          S
..       ...
886        S
887        S
888        S
889        C
890        Q

[891 rows x 1 columns]

In [10]:
df["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [11]:
df.dropna(inplace=True)

In [12]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [13]:
df=pd.read_csv("mercedes.csv",usecols=["X0","X1","X2","X3","X4","X5","X6"])

In [14]:
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X0      4209 non-null   object
 1   X1      4209 non-null   object
 2   X2      4209 non-null   object
 3   X3      4209 non-null   object
 4   X4      4209 non-null   object
 5   X5      4209 non-null   object
 6   X6      4209 non-null   object
dtypes: object(7)
memory usage: 230.3+ KB

In [16]:
df["X0"].value_counts().head()

z     360
ak    349
y     324
ay    313
t     306
Name: X0, dtype: int64

In [17]:
df.X1.value_counts().sort_values(ascending=False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [18]:
list_10=df.X1.value_counts().sort_values(ascending=False).head(10).index

In [19]:
list_10=list(list_10)

In [20]:
list_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [21]:
for i in list_10:
    df[i]=np.where(df["X1"]==i,1,0)

In [22]:
list_10.append("x1")

In [23]:
df

      X0 X1  X2 X3 X4  X5 X6  aa  s  b  l  v  r  i  a  c  o
0      k  v  at  a  d   u  j   0  0  0  0  1  0  0  0  0  0
1      k  t  av  e  d   y  l   0  0  0  0  0  0  0  0  0  0
2     az  w   n  c  d   x  j   0  0  0  0  0  0  0  0  0  0
3     az  t   n  f  d   x  l   0  0  0  0  0  0  0  0  0  0
4     az  v   n  f  d   h  d   0  0  0  0  1  0  0  0  0  0
...   .. ..  .. .. ..  .. ..  .. .. .. .. .. .. .. .. .. ..
4204  ak  s  as  c  d  aa  d   0  1  0  0  0  0  0  0  0  0
4205   j  o   t  d  d  aa  h   0  0  0  0  0  0  0  0  0  1
4206  ak  v   r  a  d  aa  g   0  0  0  0  1  0  0  0  0  0
4207  al  r   e  f  d  aa  l   0  0  0  0  0  1  0  0  0  0
4208   z  r  ae  c  d  aa  g   0  0  0  0  0  1  0  0  0  0

[4209 rows x 17 columns]

# odinal number encoding

In [24]:
#ranking is important

In [25]:
import datetime

In [26]:
today_date=datetime.datetime.today()

In [27]:
today_date

datetime.datetime(2023, 7, 18, 18, 19, 33, 849976)

In [28]:
today_date-datetime.timedelta(1)

datetime.datetime(2023, 7, 17, 18, 19, 33, 849976)

In [29]:
days=[today_date-datetime.timedelta(i) for i in  range(0,15)]

In [30]:
import pandas as pd
import numpy as np

In [31]:
df=pd.DataFrame(days)

In [32]:
df.columns=["Day"]

In [33]:
df.head()

                         Day
0 2023-07-18 18:19:33.849976
1 2023-07-17 18:19:33.849976
2 2023-07-16 18:19:33.849976
3 2023-07-15 18:19:33.849976
4 2023-07-14 18:19:33.849976

In [34]:
df["weekday"]=df["Day"].dt.day_name()

In [35]:
df.head()

                         Day   weekday
0 2023-07-18 18:19:33.849976   Tuesday
1 2023-07-17 18:19:33.849976    Monday
2 2023-07-16 18:19:33.849976    Sunday
3 2023-07-15 18:19:33.849976  Saturday
4 2023-07-14 18:19:33.849976    Friday

In [36]:
df.weekday.unique()

array(['Tuesday', 'Monday', 'Sunday', 'Saturday', 'Friday', 'Thursday',
       'Wednesday'], dtype=object)

In [37]:
dis={'Saturday':1, 'Friday':2, 'Thursday':3, 'Wednesday':4, 'Tuesday':5, 'Monday':6,
       'Sunday':7}

In [38]:
dis

{'Saturday': 1,
 'Friday': 2,
 'Thursday': 3,
 'Wednesday': 4,
 'Tuesday': 5,
 'Monday': 6,
 'Sunday': 7}

In [39]:
df["week_odinal"]=df["weekday"].map(dis)

In [40]:
df

                          Day    weekday  week_odinal
0  2023-07-18 18:19:33.849976    Tuesday            5
1  2023-07-17 18:19:33.849976     Monday            6
2  2023-07-16 18:19:33.849976     Sunday            7
3  2023-07-15 18:19:33.849976   Saturday            1
4  2023-07-14 18:19:33.849976     Friday            2
5  2023-07-13 18:19:33.849976   Thursday            3
6  2023-07-12 18:19:33.849976  Wednesday            4
7  2023-07-11 18:19:33.849976    Tuesday            5
8  2023-07-10 18:19:33.849976     Monday            6
9  2023-07-09 18:19:33.849976     Sunday            7
10 2023-07-08 18:19:33.849976   Saturday            1
11 2023-07-07 18:19:33.849976     Friday            2
12 2023-07-06 18:19:33.849976   Thursday            3
13 2023-07-05 18:19:33.849976  Wednesday            4
14 2023-07-04 18:19:33.849976    Tuesday            5

# count or frequency Encoding

In [41]:
df=pd.read_csv("adult.csv",usecols=['workclass','education','marital-status','relationship', 'race', 'gender','native-country'])

In [42]:
df.columns

Index(['workclass', 'education', 'marital-status', 'relationship', 'race',
       'gender', 'native-country'],
      dtype='object')

In [43]:
df.head()

,workclass,education,marital-status,relationship,race,gender,native-country
0,Private,11th,Never-married,Own-child,Black,Male,United-States
1,Private,HS-grad,Married-civ-spouse,Husband,White,Male,United-States
2,Local-gov,Assoc-acdm,Married-civ-spouse,Husband,White,Male,United-States
3,Private,Some-college,Married-civ-spouse,Husband,Black,Male,United-States
4,?,Some-college,Never-married,Own-child,White,Female,United-States

In [44]:
df.columns

Index(['workclass', 'education', 'marital-status', 'relationship', 'race',
       'gender', 'native-country'],
      dtype='object')

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   workclass       48842 non-null  object
 1   education       48842 non-null  object
 2   marital-status  48842 non-null  object
 3   relationship    48842 non-null  object
 4   race            48842 non-null  object
 5   gender          48842 non-null  object
 6   native-country  48842 non-null  object
dtypes: object(7)
memory usage: 2.6+ MB

In [46]:
df.isnull().sum()

workclass         0
education         0
marital-status    0
relationship      0
race              0
gender            0
native-country    0
dtype: int64

In [47]:
df.head()

,workclass,education,marital-status,relationship,race,gender,native-country
0,Private,11th,Never-married,Own-child,Black,Male,United-States
1,Private,HS-grad,Married-civ-spouse,Husband,White,Male,United-States
2,Local-gov,Assoc-acdm,Married-civ-spouse,Husband,White,Male,United-States
3,Private,Some-college,Married-civ-spouse,Husband,Black,Male,United-States
4,?,Some-college,Never-married,Own-child,White,Female,United-States

In [48]:
for feature in df.columns[:]:
    print(feature,":",len(df[feature].unique()))

workclass : 9
education : 16
marital-status : 7
relationship : 6
race : 5
gender : 2
native-country : 42

In [49]:
country_map=df["native-country"].value_counts().to_dict()

In [50]:
country_map

{'United-States': 43832,
 'Mexico': 951,
 '?': 857,
 'Philippines': 295,
 'Germany': 206,
 'Puerto-Rico': 184,
 'Canada': 182,
 'El-Salvador': 155,
 'India': 151,
 'Cuba': 138,
 'England': 127,
 'China': 122,
 'South': 115,
 'Jamaica': 106,
 'Italy': 105,
 'Dominican-Republic': 103,
 'Japan': 92,
 'Guatemala': 88,
 'Poland': 87,
 'Vietnam': 86,
 'Columbia': 85,
 'Haiti': 75,
 'Portugal': 67,
 'Taiwan': 65,
 'Iran': 59,
 'Greece': 49,
 'Nicaragua': 49,
 'Peru': 46,
 'Ecuador': 45,
 'France': 38,
 'Ireland': 37,
 'Hong': 30,
 'Thailand': 30,
 'Cambodia': 28,
 'Trinadad&Tobago': 27,
 'Laos': 23,
 'Yugoslavia': 23,
 'Outlying-US(Guam-USVI-etc)': 23,
 'Scotland': 21,
 'Honduras': 20,
 'Hungary': 19,
 'Holand-Netherlands': 1}

In [51]:
df['country']=df["native-country"].map(country_map)

In [52]:
df

,workclass,education,marital-status,relationship,race,gender,native-country,country
0,Private,11th,Never-married,Own-child,Black,Male,United-States,43832
1,Private,HS-grad,Married-civ-spouse,Husband,White,Male,United-States,43832
2,Local-gov,Assoc-acdm,Married-civ-spouse,Husband,White,Male,United-States,43832
3,Private,Some-college,Married-civ-spouse,Husband,Black,Male,United-States,43832
4,?,Some-college,Never-married,Own-child,White,Female,United-States,43832
...,...,...,...,...,...,...,...,...
48837,Private,Assoc-acdm,Married-civ-spouse,Wife,White,Female,United-States,43832
48838,Private,HS-grad,Married-civ-spouse,Husband,White,Male,United-States,43832
48839,Private,HS-grad,Widowed,Unmarried,White,Female,United-States,43832
48840,Private,HS-grad,Never-married,Own-child,White,Male,United-States,43832
48841,Self-emp-inc,HS-grad,Married-civ-spouse,Wife,White,Female,United-States,43832

In [53]:
df['native-country'].replace("?","United-States",inplace=True)

In [54]:
df["native-country"].value_counts()

United-States                 44689
Mexico                          951
Philippines                     295
Germany                         206
Puerto-Rico                     184
Canada                          182
El-Salvador                     155
India                           151
Cuba                            138
England                         127
China                           122
South                           115
Jamaica                         106
Italy                           105
Dominican-Republic              103
Japan                            92
Guatemala                        88
Poland                           87
Vietnam                          86
Columbia                         85
Haiti                            75
Portugal                         67
Taiwan                           65
Iran                             59
Greece                           49
Nicaragua                        49
Peru                             46
Ecuador                          45
France                           38
Ireland                          37
Hong                             30
Thailand                         30
Cambodia                         28
Trinadad&Tobago                  27
Yugoslavia                       23
Outlying-US(Guam-USVI-etc)       23
Laos                             23
Scotland                         21
Honduras                         20
Hungary                          19
Holand-Netherlands                1
Name: native-country, dtype: int64

# trget guided odinal encoding()

In [55]:
df=pd.read_csv("titanic.csv",usecols=["Cabin","Survived"])

In [56]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [57]:
df["Cabin"].fillna("missing",inplace=True)

In [58]:
df["Cabin"]=df["Cabin"].astype(str).str[0]

In [59]:
df.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [60]:
df.groupby(["Cabin"])["Survived"].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64

In [61]:
odinal_label=df.groupby(["Cabin"])["Survived"].mean().sort_values().index

In [62]:
odinal_label

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [63]:
odinal_lable1={k:i for i,k in enumerate(odinal_label,0)}

In [64]:
odinal_lable1

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [65]:
df["cabins"]=df["Cabin"].map(odinal_lable1)

In [66]:
df

     Survived Cabin  cabins
0           0     m       1
1           1     C       4
2           1     m       1
3           1     C       4
4           0     m       1
..        ...   ...     ...
886         0     m       1
887         1     B       6
888         0     m       1
889         1     C       4
890         0     m       1

[891 rows x 3 columns]

In [67]:
#mean encoding

In [68]:
mean=df.groupby(["Cabin"])["Survived"].mean().to_dict()

In [69]:
mean

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'T': 0.0,
 'm': 0.29985443959243085}

In [70]:
df["mean"]=df["Cabin"].map(mean)

In [71]:
df.drop(["cabins"],inplace=True,axis=1)

In [72]:
df

     Survived Cabin      mean
0           0     m  0.299854
1           1     C  0.593220
2           1     m  0.299854
3           1     C  0.593220
4           0     m  0.299854
..        ...   ...       ...
886         0     m  0.299854
887         1     B  0.744681
888         0     m  0.299854
889         1     C  0.593220
890         0     m  0.299854

[891 rows x 3 columns]